[v10.4]
1=Verbesserter Algorithmus zum Scannen von Datenresten, um mehr Reste zu finden und zu bereinigen
2=Erweiterte Datenbank zum Entfernen von 350 weiteren hartnäckigen Programmen
3=Verbesserter Entfernung hartnäckiger Programme, um Programme mit Deinstallationsproblemen genauer zu erkennen
4=Verbesserte Benutzeroberfläche
5=Alle bekannten Fehler wurden behoben

[v10.3]
1=Verbessertes Scannen von Datenresten, um mehr Dateien und Registrierungseinträge zu bereinigen
2=Verbesserte Deinstallations-Engine, um sehr große Programme gründlicher zu entfernen
3=Erweiterte Datenbank zum Entfernen von 210 weiteren hartnäckigen Programmen
4=Hinzugefügte Unterstützung, um das Detailfenster von Deinstallationsverlauf und Installationsprotokoll zu maximieren
5=Das Rekonfigurationsproblem mit Apps in Win 10 wurde behoben
6=Alle bekannten Fehler wurden behoben

[v10.2]
1=Verbesserter Entferner für hartnäckige Programme, um mehr Probleme bei der Deinstallation von Microsoft-Installationsprogrammen zu erkennen
2=Vergrößerte Datenbank zum Entfernen von 240 mehr hartnäckigen Programmen
3=Verbesserter Scan-Algorithmus für Datenresten, um mehr Datenreste nach der Deinstallation des Programms zu scannen
4=Optimierter Install Monitor für ein vollständigeres Installationsprotokoll bei der Überwachung von Software-Updates
5=Bessere Benutzeroberfläche von Software Updater für eine benutzerfreundlichere Erfahrung
6=Alle bekannten Fehler wurden behoben

[v10.1]
1=Neuer Entferner für hartnäckige Programme, um hartnäckige Programme viel einfacher zu entfernen
2=Vergrößerte Datenbank zum Entfernen von 200 mehr hartnäckigen Programmen
3=Benutzerdefinierte Option, ob Leistungsstarke Deinstallation im Windows-Kontextmenü angezeigt werden soll
4=Benutzerdefinierte Option, ob System-Laufzeitkomponenten in der Programmliste angezeigt werden sollen
5=Das gelegentliche Problem der ungenauen Erkennung der Programmgröße und der instabilen Installationsüberwachung von übergroßen Programmen wurde behoben
6=Alle bekannten Fehler wurden behoben

[v10.0]
1=Die Deinstallationsgeschwindigkeit wurde um 50% erhöht
2=Verbesserter Scan-Algorithmus zum Scannen von 30% mehr Deinstallationsresten
3=Verbesserte Software-Integrität für das Blockieren von Site-Benachrichtigungen
4=Erweiterter Installationsmonitor zur Überwachung weiterer Programminstallationen und zur neuen Unterstützung von Überwachungssystemdiensten, geplanten Aufgaben und DLL-Registrierung
5=Verbesserter Algorithmus zur Erkennung von seltenen Programmen und Bundleware
6=Falsche Eingabeaufforderungen nach dem Aktualisieren von Programme wurden behoben
7=Deinstallation von mehr als 40 hartnäckigen Programmen wie MPC-HC, SpyHunter5, Avast Antivirus, Rockstar Games, IntelliJ IDEA und mehr hinzugefügt
8=NEU: Aktualisieren mehrsprachiger Versionen beliebter Programme wie Firefox, WinRAR und Mozilla Thunderbird
9=NEU: Entfernen von Microsoft Edge (Chromium) Plug-Ins
10=Verbesserte Benutzeroberfläche für eine benutzerfreundlichere Erfahrung
11=Zwei Skins: Dunkel & Hell
12=Lokalisierung: 38 Sprachen